# Dataset

In [1]:
import pandas as pd
df_list = [
  ["Michael Jackson", 1087, "Smooth criminal", "QB"]
  , ["Russell Crowe", 2000, "Gladiator", "QB"]
  , ["Brad Pitt", 1999, "Fight Club", "DT"]
  , ["Edward Norton", 1996, "Primal Fear", "QB"]
  , ["Helena Bonham Carter", 1005, "Corpse Bride", "WR"]
  , ["Johnny Depp", 2003, "Pirates of the Caribbean", "RB"]
  , ["Keira Knightley", 2005, "Prode & Prejudice", "TE"]
  , ["James McAvoy", 2016, "Split", "WR"]
  , ["Aaron Taylor-Johnson", 2022, "Bullet Train", "CB"]
  , ["Elizabeth Olsen", 2021, "Wanda Vision", "RB"]
]
df_columns = ["Name", "Year", "Famous For", "Code"]
players = pd.DataFrame(data=df_list, columns=df_columns)

# SELECT

## Extract all
`SELECT * FROM players`

In [2]:
players

                   Name  Year                Famous For Code
0       Michael Jackson  1087           Smooth criminal   QB
1         Russell Crowe  2000                 Gladiator   QB
2             Brad Pitt  1999                Fight Club   DT
3         Edward Norton  1996               Primal Fear   QB
4  Helena Bonham Carter  1005              Corpse Bride   WR
5           Johnny Depp  2003  Pirates of the Caribbean   RB
6       Keira Knightley  2005         Prode & Prejudice   TE
7          James McAvoy  2016                     Split   WR
8  Aaron Taylor-Johnson  2022              Bullet Train   CB
9       Elizabeth Olsen  2021              Wanda Vision   RB

## Projection of some columns
`SELECT Name, Age FROM players`

In [4]:
players[["Name", "Year"]]

                   Name  Year
0       Michael Jackson  1087
1         Russell Crowe  2000
2             Brad Pitt  1999
3         Edward Norton  1996
4  Helena Bonham Carter  1005
5           Johnny Depp  2003
6       Keira Knightley  2005
7          James McAvoy  2016
8  Aaron Taylor-Johnson  2022
9       Elizabeth Olsen  2021

## Selection of top some rows
`SELECT TOP 5 * FROM players`

In [5]:
players.head(5)

                   Name  Year       Famous For Code
0       Michael Jackson  1087  Smooth criminal   QB
1         Russell Crowe  2000        Gladiator   QB
2             Brad Pitt  1999       Fight Club   DT
3         Edward Norton  1996      Primal Fear   QB
4  Helena Bonham Carter  1005     Corpse Bride   WR

## DISTINCT
`SELECT DISTINCT Position FROM players`

In [6]:
players["Code"][~players["Code"].duplicated()]

0    QB
2    DT
4    WR
5    RB
6    TE
8    CB
Name: Code, dtype: object

In [7]:
players["Code"].unique()

array(['QB', 'DT', 'WR', 'RB', 'TE', 'CB'], dtype=object)

# WHERE

## Selection of specific rows with condition
`SELECT * FROM players WHERE Position = 'QB'`

In [8]:
players[players.Code == "QB"]

              Name  Year       Famous For Code
0  Michael Jackson  1087  Smooth criminal   QB
1    Russell Crowe  2000        Gladiator   QB
3    Edward Norton  1996      Primal Fear   QB

In [9]:
players[players["Code"] == "QB"]

              Name  Year       Famous For Code
0  Michael Jackson  1087  Smooth criminal   QB
1    Russell Crowe  2000        Gladiator   QB
3    Edward Norton  1996      Primal Fear   QB

## Selection of specific rows & projection of some columns
`SELECT Name, Age FROM players WHERE Position = 'QB'`

In [10]:
players[["Name", "Year"]][players.Code == "QB"]

              Name  Year
0  Michael Jackson  1087
1    Russell Crowe  2000
3    Edward Norton  1996

In [11]:
players[players["Code"] == "QB"][["Name", "Year"]]

              Name  Year
0  Michael Jackson  1087
1    Russell Crowe  2000
3    Edward Norton  1996

## NOT
`SELECT * FROM players WHERE NOT Position =='QB'`

In [12]:
players[~(players.Code == "QB")]

                   Name  Year                Famous For Code
2             Brad Pitt  1999                Fight Club   DT
4  Helena Bonham Carter  1005              Corpse Bride   WR
5           Johnny Depp  2003  Pirates of the Caribbean   RB
6       Keira Knightley  2005         Prode & Prejudice   TE
7          James McAvoy  2016                     Split   WR
8  Aaron Taylor-Johnson  2022              Bullet Train   CB
9       Elizabeth Olsen  2021              Wanda Vision   RB

In [13]:
players[~(players["Code"] == "QB")]

                   Name  Year                Famous For Code
2             Brad Pitt  1999                Fight Club   DT
4  Helena Bonham Carter  1005              Corpse Bride   WR
5           Johnny Depp  2003  Pirates of the Caribbean   RB
6       Keira Knightley  2005         Prode & Prejudice   TE
7          James McAvoy  2016                     Split   WR
8  Aaron Taylor-Johnson  2022              Bullet Train   CB
9       Elizabeth Olsen  2021              Wanda Vision   RB

## AND
`SELECT Name, Age FROM players WHERE Position = 'QB' AND Age < 30`

In [15]:
players[["Name", "Year"]][(players.Code == "QB") & (players.Year < 1999)]

              Name  Year
0  Michael Jackson  1087
3    Edward Norton  1996

## OR
`SELECT Name, Age FROM players WHERE Position = 'QB' OR Position = 'RB'`

In [16]:
players[["Name", "Year"]][(players.Code == "QB") |(players.Code == "RB")]

              Name  Year
0  Michael Jackson  1087
1    Russell Crowe  2000
3    Edward Norton  1996
5      Johnny Depp  2003
9  Elizabeth Olsen  2021

## AND / OR
`SELECT Name, Age FROM players WHERE (Position = 'QB' AND Age < 25) OR (Position = 'RB' AND Age < 25)`

In [17]:
players[["Name", "Year"]][
(
    (players.Code == "QB") & (players.Year < 2000)
) | (
    (players.Code == "RB") & (players.Year < 2000)
)]

              Name  Year
0  Michael Jackson  1087
3    Edward Norton  1996

### TIPS
You have to put operator by brackets.

Otherwise, you will get an `TypeError: Cannot perform ‘rand_’ with a dtyped [int64] array and scalar of type [bool]`

`players[["Name", "Age"]][players.Position == "QB" & players.Age < 30]`

You also have to use ‘&’ and ‘|’ instead of ‘and’ and ‘or’.

Otherwise, you will get an `ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().`

`players[["Name", "Age"]][(players.Position == "QB") and (players.Age < 30)]`

## IN
`SELECT * FROM players WHERE Position IN ('QB', 'RB')`

In [18]:
players[players.Code.isin(["QB", "RB"])]

              Name  Year                Famous For Code
0  Michael Jackson  1087           Smooth criminal   QB
1    Russell Crowe  2000                 Gladiator   QB
3    Edward Norton  1996               Primal Fear   QB
5      Johnny Depp  2003  Pirates of the Caribbean   RB
9  Elizabeth Olsen  2021              Wanda Vision   RB

## LIKE
`SELECT * FROM players WHERE Team LIKE '%ns%'`

In [20]:
players[players['Famous For'].str.contains("gh")]

        Name  Year  Famous For Code
2  Brad Pitt  1999  Fight Club   DT

# ORDER BY

## Order by 1 column
`SELECT * FROM players ORDER BY Name`

In [21]:
players.sort_values("Name")

                   Name  Year                Famous For Code
8  Aaron Taylor-Johnson  2022              Bullet Train   CB
2             Brad Pitt  1999                Fight Club   DT
3         Edward Norton  1996               Primal Fear   QB
9       Elizabeth Olsen  2021              Wanda Vision   RB
4  Helena Bonham Carter  1005              Corpse Bride   WR
7          James McAvoy  2016                     Split   WR
5           Johnny Depp  2003  Pirates of the Caribbean   RB
6       Keira Knightley  2005         Prode & Prejudice   TE
0       Michael Jackson  1087           Smooth criminal   QB
1         Russell Crowe  2000                 Gladiator   QB

## Order by 2+ columns
`SELECT * FROM players ORDER BY Age, Name`

In [22]:
players.sort_values(["Year", "Name"])

                   Name  Year                Famous For Code
4  Helena Bonham Carter  1005              Corpse Bride   WR
0       Michael Jackson  1087           Smooth criminal   QB
3         Edward Norton  1996               Primal Fear   QB
2             Brad Pitt  1999                Fight Club   DT
1         Russell Crowe  2000                 Gladiator   QB
5           Johnny Depp  2003  Pirates of the Caribbean   RB
6       Keira Knightley  2005         Prode & Prejudice   TE
7          James McAvoy  2016                     Split   WR
9       Elizabeth Olsen  2021              Wanda Vision   RB
8  Aaron Taylor-Johnson  2022              Bullet Train   CB

## DESC
`SELECT * FROM players ORDER BY Age DESC, Name`

In [24]:
players.sort_values(["Year", "Name"], ascending=[False, True])

                   Name  Year                Famous For Code
8  Aaron Taylor-Johnson  2022              Bullet Train   CB
9       Elizabeth Olsen  2021              Wanda Vision   RB
7          James McAvoy  2016                     Split   WR
6       Keira Knightley  2005         Prode & Prejudice   TE
5           Johnny Depp  2003  Pirates of the Caribbean   RB
1         Russell Crowe  2000                 Gladiator   QB
2             Brad Pitt  1999                Fight Club   DT
3         Edward Norton  1996               Primal Fear   QB
0       Michael Jackson  1087           Smooth criminal   QB
4  Helena Bonham Carter  1005              Corpse Bride   WR

# GROUP BY

## COUNT
`SELECT COUNT(*) AS COUNT FROM players GROUP BY Position`

In [25]:
players.groupby("Code").agg({"Name": "count"}).rename(columns={"Name": "COUNT"})

      COUNT
Code
CB        1
DT        1
QB        3
RB        2
TE        1
WR        2

## SUM
`SELECT SUM(Age) AS Age FROM players GROUP BY Position`

In [26]:
players.groupby("Code").agg({"Year": "sum"})

      Year
Code
CB    2022
DT    1999
QB    5083
RB    4024
TE    2005
WR    3021

## AVG
`SELECT AVG(Age) AS Age FROM players GROUP BY Position`

In [27]:
players.groupby("Code").agg({"Year": "mean"})

             Year
Code
CB    2022.000000
DT    1999.000000
QB    1694.333333
RB    2012.000000
TE    2005.000000
WR    1510.500000

## RANK
`SELECT *, RANK() OVER (ORDER BY Age DESC) FROM players`

In [28]:
players["YearRank"] = players.Year.rank(ascending=False)
players

                   Name  Year                Famous For Code  YearRank
0       Michael Jackson  1087           Smooth criminal   QB       9.0
1         Russell Crowe  2000                 Gladiator   QB       6.0
2             Brad Pitt  1999                Fight Club   DT       7.0
3         Edward Norton  1996               Primal Fear   QB       8.0
4  Helena Bonham Carter  1005              Corpse Bride   WR      10.0
5           Johnny Depp  2003  Pirates of the Caribbean   RB       5.0
6       Keira Knightley  2005         Prode & Prejudice   TE       4.0
7          James McAvoy  2016                     Split   WR       3.0
8  Aaron Taylor-Johnson  2022              Bullet Train   CB       1.0
9       Elizabeth Olsen  2021              Wanda Vision   RB       2.0

## RANK + PARTITION BY
`SELECT *, RANK() OVER (PARTITION BY Position ORDER BY Age DESC) FROM players`

In [29]:
players["YearRank"] = players.groupby("Code")["Year"].rank(ascending=False)
players

                   Name  Year                Famous For Code  YearRank
0       Michael Jackson  1087           Smooth criminal   QB       3.0
1         Russell Crowe  2000                 Gladiator   QB       1.0
2             Brad Pitt  1999                Fight Club   DT       1.0
3         Edward Norton  1996               Primal Fear   QB       2.0
4  Helena Bonham Carter  1005              Corpse Bride   WR       2.0
5           Johnny Depp  2003  Pirates of the Caribbean   RB       2.0
6       Keira Knightley  2005         Prode & Prejudice   TE       1.0
7          James McAvoy  2016                     Split   WR       1.0
8  Aaron Taylor-Johnson  2022              Bullet Train   CB       1.0
9       Elizabeth Olsen  2021              Wanda Vision   RB       1.0

## DENSE
`SELECT *, DENSE_RANK() OVER (ORDER BY Age DESC) FROM players`

In [30]:
players["YearRank"] = players.Year.rank(method="dense", ascending=False)
players

                   Name  Year                Famous For Code  YearRank
0       Michael Jackson  1087           Smooth criminal   QB       9.0
1         Russell Crowe  2000                 Gladiator   QB       6.0
2             Brad Pitt  1999                Fight Club   DT       7.0
3         Edward Norton  1996               Primal Fear   QB       8.0
4  Helena Bonham Carter  1005              Corpse Bride   WR      10.0
5           Johnny Depp  2003  Pirates of the Caribbean   RB       5.0
6       Keira Knightley  2005         Prode & Prejudice   TE       4.0
7          James McAvoy  2016                     Split   WR       3.0
8  Aaron Taylor-Johnson  2022              Bullet Train   CB       1.0
9       Elizabeth Olsen  2021              Wanda Vision   RB       2.0

# UPDATE

`UPDATE players SET Age = 0 WHERE Age = 24`

In [31]:
players.loc[players.Year == 1005, "Year"] = 2005
players

                   Name  Year                Famous For Code  YearRank
0       Michael Jackson  1087           Smooth criminal   QB       9.0
1         Russell Crowe  2000                 Gladiator   QB       6.0
2             Brad Pitt  1999                Fight Club   DT       7.0
3         Edward Norton  1996               Primal Fear   QB       8.0
4  Helena Bonham Carter  2005              Corpse Bride   WR      10.0
5           Johnny Depp  2003  Pirates of the Caribbean   RB       5.0
6       Keira Knightley  2005         Prode & Prejudice   TE       4.0
7          James McAvoy  2016                     Split   WR       3.0
8  Aaron Taylor-Johnson  2022              Bullet Train   CB       1.0
9       Elizabeth Olsen  2021              Wanda Vision   RB       2.0

In [32]:
players['Year'].replace(1087, 1987, inplace=True)

# JOIN

## Dataset

In [34]:
df_team = [
  [1, "Arizona Diamondbacks"]
  , [2, "Colorado Rockies"]
  , [3, "Los Angeles Dodgers"]
  , [4, "San Diego Padres"]
  , [5, "San Francisco Giants"]
]
team_columns = ["Id", "Name"]
teams = pd.DataFrame(data=df_team, columns=team_columns)
teams

   Id                  Name
0   1  Arizona Diamondbacks
1   2      Colorado Rockies
2   3   Los Angeles Dodgers
3   4      San Diego Padres
4   5  San Francisco Giants

In [35]:
df_player = [
  [1, "Cody Bellinger", 3, "OF"]
  , [2, "Mookie Betts", 3, "OF"]
  , [3, "Nolan Arenado", 2, "3B"]
  , [4, "Trevor Story", 2, "SS"]
  , [5, "Fernando Tatis Jr.", 4, "SS"]
  , [6, "Buster Posey", 5, "C"]
  , [7, "Starling Marte", 1, "OF"]
  , [8, "Manny Machado", 4, "3B"]
]
player_columns = ["Id", "Name", "TeamId", "Position"]
players = pd.DataFrame(data=df_player, columns=player_columns)
players

   Id                Name  TeamId Position
0   1      Cody Bellinger       3       OF
1   2        Mookie Betts       3       OF
2   3       Nolan Arenado       2       3B
3   4        Trevor Story       2       SS
4   5  Fernando Tatis Jr.       4       SS
5   6        Buster Posey       5        C
6   7      Starling Marte       1       OF
7   8       Manny Machado       4       3B

In [36]:
df_homerun = [
  [2, 16]
  , [5, 15]
  , [8, 16]
]
homerun_columns = ["PlayerId", "Homerun"]
homeruns = pd.DataFrame(data=df_homerun, columns=homerun_columns)
homeruns

   PlayerId  Homerun
0         2       16
1         5       15
2         8       16

## INNER JOIN


```
SELECT
  p.Id
  ,p.Name
  ,h.Homerun
FROM players p
INNER JOIN homeruns h
  ON p.Id = h.PlayerId
```

In [37]:
player_homerun = pd.merge(players, homeruns, left_on="Id", right_on="PlayerId", how="inner")
player_homerun

   Id                Name  TeamId Position  PlayerId  Homerun
0   2        Mookie Betts       3       OF         2       16
1   5  Fernando Tatis Jr.       4       SS         5       15
2   8       Manny Machado       4       3B         8       16

If each table have several keys, you set the “on” parameter as list.


```
player_homerun = pd.merge(players, homeruns, left_on=["Id", "xx", ...], right_on=["PlayerId", "xx", ...], how="inner")
```

You can use the suffix for each column.

In [38]:
player_team = pd.merge(players, teams, left_on="TeamId", right_on="Id", how="inner", suffixes=["_player", "_team"])
player_team

,Id_player,Name_player,TeamId,Position,Id_team,Name_team
0,1,Cody Bellinger,3,OF,3,Los Angeles Dodgers
1,2,Mookie Betts,3,OF,3,Los Angeles Dodgers
2,3,Nolan Arenado,2,3B,2,Colorado Rockies
3,4,Trevor Story,2,SS,2,Colorado Rockies
4,5,Fernando Tatis Jr.,4,SS,4,San Diego Padres
5,8,Manny Machado,4,3B,4,San Diego Padres
6,6,Buster Posey,5,C,5,San Francisco Giants
7,7,Starling Marte,1,OF,1,Arizona Diamondbacks

And then you can rename column later.

In [39]:
player_team = player_team.rename(
  columns={
    "Id_player": "PlayerId"
    ,"Name_player": "PlayerName"
    ,"Name_team": "TeamName"
  }
)
player_team

,PlayerId,PlayerName,TeamId,Position,Id_team,TeamName
0,1,Cody Bellinger,3,OF,3,Los Angeles Dodgers
1,2,Mookie Betts,3,OF,3,Los Angeles Dodgers
2,3,Nolan Arenado,2,3B,2,Colorado Rockies
3,4,Trevor Story,2,SS,2,Colorado Rockies
4,5,Fernando Tatis Jr.,4,SS,4,San Diego Padres
5,8,Manny Machado,4,3B,4,San Diego Padres
6,6,Buster Posey,5,C,5,San Francisco Giants
7,7,Starling Marte,1,OF,1,Arizona Diamondbacks

## LEFT / RIGHT OUTER JOIN


```
SELECT
  p.Id
  ,p.Name
  ,h.Homerun
FROM players p
LEFT JOIN homeruns h
  ON p.Id = h.PlayerId
```

In [40]:
player_homerun = pd.merge(players, homeruns, left_on="Id", right_on="PlayerId", how="left")
player_homerun

   Id                Name  TeamId Position  PlayerId  Homerun
0   1      Cody Bellinger       3       OF       NaN      NaN
1   2        Mookie Betts       3       OF       2.0     16.0
2   3       Nolan Arenado       2       3B       NaN      NaN
3   4        Trevor Story       2       SS       NaN      NaN
4   5  Fernando Tatis Jr.       4       SS       5.0     15.0
5   6        Buster Posey       5        C       NaN      NaN
6   7      Starling Marte       1       OF       NaN      NaN
7   8       Manny Machado       4       3B       8.0     16.0

## FULL OUTER JOIN


```
SELECT
  p.Id
  ,p.Name
  ,h.Homerun
FROM players p
FULL JOIN homeruns h
  ON p.Id = h.PlayerId
```

In [41]:
player_homerun = pd.merge(players, homeruns, left_on="Id", right_on="PlayerId", how="outer")
player_homerun

   Id                Name  TeamId Position  PlayerId  Homerun
0   1      Cody Bellinger       3       OF       NaN      NaN
1   2        Mookie Betts       3       OF       2.0     16.0
2   3       Nolan Arenado       2       3B       NaN      NaN
3   4        Trevor Story       2       SS       NaN      NaN
4   5  Fernando Tatis Jr.       4       SS       5.0     15.0
5   6        Buster Posey       5        C       NaN      NaN
6   7      Starling Marte       1       OF       NaN      NaN
7   8       Manny Machado       4       3B       8.0     16.0